{
    "title": "Guillaume Lévesque - Personal page",
    "experience.title" : "experience",
    "projet.title" : "projects",
    "menu" : {
        "home": "home",
        "about": "about",
        "projects": "projects",
        "contact": "contact"
    },
    "personalinfo.name": "guillaume lévesque",
    "personalinfo.contact": "514.835.0203",
    "raic.period": "june 2021 – present",
    "raic.role": "analyst programmer at desjardins",
    "raic.details1": "specialized in java (primarily spring boot), developing rest services.",
    "raic.details2": "development of devops interaction and integration services (ci/cd -> docker/docker swarm, concourse pcf kubernetes), security analysis (crypto), test automation.",
    "code3.period": "november 2019 – june 2021",
    "code3.role": "software developer and devops at code3",
    "code3.details1": "set up of ci/cd, server maintenance and installations (linux and mac), web development (spring boot and liferay).",
    "code3.details2": "development of internal tools and analytics software. security analysis and security updates.",
    "opq.period": "may 2014 – november 2019",
    "opq.role": "apple genius",
    "opq.details1": "after-sales service, floor management (genius bar), device repair (iphone, mac), trainer.",
    "desjardins.period": "2022 - present",
    "desjardins.role": "desjardins – consent",
    "desjardins.details1": "development of a highly available and highly efficient data management system for the entire desjardins group.",
    "desjardins.details2": "achievements include the development of a suite of applications, web and api, technical and functional analysis of business needs, creation of a metrics system, batch processing, rabbitmq systems, etc.",
    "education.title": "education",
    "uqam.year": "2020",
    "uqam.degree": "bachelor's degree in computer science",
    "uqam.institution": "university of montreal, montreal, qc",
    "sthya.year": "2015",
    "sthya.degree": "dec in computer sciences",
    "sthya.institution": "cégep de sherbrooke, sherbrooke, qc",
    "skills.title": "technical skills",
    "skills.java": "java",
    "skills.spring": "spring",
    "skills.angular": "angular",
    "skills.python": "python",
    "skills.web": "web (js, ts, css, html, etc)",
    "skills.devops": "devops (ci/cd, docker, jenkins, ansible, etc)",
    "skills.php": "php",
    "skills.css": "css (tailwind)",
    "skills.databases": "mysql, oracle, postgres, mongodb, azure",
    "skills.cpp": "c++",
    "skills.os": "linux, mac, windows",
    "skills.git": "git",
    "skills.etc": "etc",
    "contact.title": "contact",
    "contact.name": "full name",
    "contact.email": "email",
    "contact.message": "message",
    "home": {
        "phrase": "learning is facing the storms of ignorance and sailing on the waves of knowledge, resilient in the face of challenges, growing with each lesson learned.",
        "climbinsight": {
          "frontendtitle": "climb insight - frontend",
          "backendtitle": "climb insight - backend",
          "frontenddescription": "angular frontend providing an interactive user interface for registration, organizing climbing championships, and live consultation of results on mobiles and tablets.",
          "backenddescription": "django backend managing user registration, organization of climbing championships, and live display of results."
        },
        "gameoflife": {
          "title": "game of life",
          "description": "a startup project aimed at implementing a choice-based game built with unity and c++."
        }
    },
    "project.title": "Major Projects",
    "project.env": "Technological Environment",
    "skills.liferay": "liferay",
    "skills.oracle": "oracle",
    "project1.period": "June 2020 - September 2020",
    "project1.name": "RAIC",
    "project1.detail1": "Creation of a web platform for the Canadian architects' guide.",
    "project1.detail2": "Achievements include the deployment of a Liferay platform, constant exchange with the client, writing and deploying a wiki, writing scripts for system administrators, and writing modules (portlets) on demand for Liferay.",
    "project2.period": "2020 – 2021",
    "project2.name": "CODE3 - Ticketing",
    "project2.detail1": "JIRA facade for clients. Platform interacting with the JIRA API for access to project tickets on Atlassian's cloud platform.",
    "project2.detail2": "Achievements include development in Java 11 with Spring Boot, architecture of the web application and database with PostgreSQL, writing REST APIs, using and understanding the JIRA (and Confluence) API, and deployment pipeline with Docker Swarm and Jenkins.",
    "project3.period": "May 2014 – November 2019",
    "project3.name": "OPQ",
    "project3.detail1": "Security update of the entire web platform, addition of custom modules and maintenance.",
    "project3.detail2": "Achievements include the addition of encryptions, Google Analytics, custom search module, website maintenance, and code refactoring for performance optimization.",
    "project4.period": "2022 - present",
    "project4.name": "Desjardins – Consent",
    "project4.detail1": "Development of a high availability and highly efficient data management system for the entire Desjardins Group.",
    "project4.detail2": "Achievements include the development of a suite of applications, web and API, technical and functional analysis of business needs, creation of a metrics system, batch processing, RabbitMQ systems, etc.",
    "contact.phrase": "Behind Every Challenge Lies a Solution Waiting to Be Discovered. Let's Uncover It Together.",
    "contact.form.name": "full name",
    "contact.form.email": "email",
    "contact.form.message": "message",
    "contact.form.confirmation": "do you want to send the message? (y/N)",    
    "contact.form.prompt1" : "enter your name and press return:",
    "contact.form.prompt2" : "enter your email address and press return:",
    "contact.form.prompt3" : "enter your message and press return:",
    "landingpage": "currently building it...",
    "phrase1": "In the garden of wisdom, every cultivated thought is a flower of knowledge.",
    "phrase2": "Patience is the art of hoping serenely in the tumult of time.",
    "phrase3": "Truth is a lighthouse in the ocean of uncertainties, guiding lost ships to the shores of clarity.",
    "phrase4": "Curiosity is the brush that paints the colors of understanding on the canvas of life.",
    "phrase5": "Each failure is a seed from which the tree of success can sprout.",
    "phrase6": "Courage is the light that shines in the darkness of fear.",
    "phrase7": "In the mirror of the past, we find lessons to build the future.",
    "phrase8": "Friendship is a bridge between souls, built on the foundations of trust and empathy.",
    "phrase9": "Harmony is the music of life, played on the strings of balance and peace.",
    "phrase10": "Humility is the key that opens the doors of wisdom.",
    "phrase11": "In silence, we hear the whispers of truth.",
    "phrase12": "Compassion is the sun that warms the cold hearts of indifference.",
    "phrase13": "The mind is a bird, and each new idea is a sky to explore.",
    "phrase14": "Gratitude is the rarest and most beautiful flower in the garden of life.",
    "phrase15": "In every problem lies an opportunity to grow and learn.",
    "phrase16": "Perseverance is the rocky path that leads to the summit of the mountain of success.",
    "phrase17": "Happiness is a butterfly which, when pursued, is always just beyond your grasp, but which, if you will sit down quietly, may alight upon you.",
    "phrase18": "Life is a book, and those who do not travel read only one page.",
    "phrase19": "In the symphony of life, every note counts, even the quietest.",
    "phrase20": "Love is the only force capable of transforming an enemy into a friend.",
    "phrase21": "The joy of living is a fragrance that one cannot spread on others without getting a few drops on oneself.",
    "phrase22": "Wisdom is the fruit of experience, ripened on the tree of life.",
    "phrase23": "Tolerance is the fabric that binds the diverse threads of humanity into a tapestry of peace.",
    "phrase24": "Every smile is a light in the window of the soul, indicating that the heart is at home.",
    "phrase25": "Creativity is the dance of the mind on the stage of possibilities.",
    "phrase26": "Integrity is the silent guardian of honor.",
    "phrase27": "Respect is the universal language that everyone can understand.",
    "phrase28": "In the silence of nature, one discovers the answers to life's loudest questions.",
    "phrase29": "Sharing is the magic that multiplies joy and divides sorrow.",
    "phrase30": "Enthusiasm is the wind that fills the sails of the ship of our dreams.",
    "perso.desc" : "I am <strong>Guillaume Lévesque</strong>, a French Canadian software engineer specializing in Java (Spring), Angular, PHP, and Python. My approach is centered on innovation and efficiency, with solid experience in developing complete software solutions. This site is a showcase of my projects and skills, demonstrating my ability to tackle complex technological challenges. Explore my achievements and do not hesitate to contact me to discuss potential collaborations."
  }
  