{
    "title": "Guillaume Lévesque - Page personnelle",
    "experience.title" : "expérience",
    "projet.title" : "projets",
    "menu" : {
      "home": "Accueil",
      "about": "à propos",
      "projects": "projets",
      "contact": "contact"
  },
    "personalinfo.name": "guillaume lévesque",
    "personalinfo.contact": "514.835.0203",
    "raic.period": "juin 2021 – aujourd’hui",
    "raic.role": "analyste programmeur desjardins",
    "raic.details1": "spécialisé en java (majoritairement spring boot), développement de services rest.",
    "raic.details2": "développement de services d’interaction et d’intégration devops (ci/cd -> docker/docker swarm, concourse pcf kubernetes), analyse de sécurité (crypto), automatisation de tests.",
    "code3.period": "novembre 2019 – juin 2021",
    "code3.role": "développeur de logiciel et devops code3",
    "code3.details1":"mise en place de ci/cd, installations et entretiens de serveurs (linux et mac), développement web (spring boot et liferay).",
    "code3.details2": "développement d’outils internes et de logiciel d’analytique. analyse de sécurité et mise à jour de sécurité.",
    "opq.period": "mai 2014 – novembre 2019",
    "opq.role": "genius apple",
    "opq.details1": "service d’après vente, gestion du plancher (genius bar), réparation d’appareil (iphone, mac), formateur.",
    "desjardins.period": "2022 - aujourd'hui",
    "desjardins.role": "desjardins – consentement",
    "desjardins.details1": "développement d'un système de gestion de données à haute disponibilité et hyper efficace pour l'ensemble du mouvement desjardins.",
    "desjardins.details2": "réalisations incluent le développement d'une suite d'applications, web et api, l'analyse technique et fonctionnelle des besoins métier, la création d'un système de métriques, de traitements par lots, de systèmes rabbitmq, etc.",
    "education.title": "éducation",
    "uqam.year": "2020",
    "uqam.degree": "baccalauréat en informatique",
    "uqam.institution": "université de montréal, montréal, qc",
    "sthya.year": "2015",
    "sthya.degree": "dec en sciences informatiques",
    "sthya.institution": "cégep de sherbrooke, sherbrooke, qc",
    "skills.title": "compétences techniques",
    "skills.java": "java",
    "skills.spring": "spring",
    "skills.angular": "angular",
    "skills.python": "python",
    "skills.web": "web (js, ts, css, html, etc)",
    "skills.devops": "devops (ci/cd, docker, jenkins, ansible, etc)",
    "skills.php": "php",
    "skills.css": "css (tailwind)",
    "skills.databases": "mysql, oracle, postgres, mongodb, azure",
    "skills.cpp": "c++",
    "skills.os": "linux, mac, windows",
    "skills.git": "git",
    "skills.etc": "etc",
    "contact.title": "contact",
    "contact.name": "full name",
    "contact.email": "email",
    "contact.message": "message",
    "home" : {
        "phrase": "apprendre, c'est affronter les tempêtes de l'ignorance et naviguer sur les vagues de la connaissance, résilient face aux défis, grandissant avec chaque leçon apprise. ",
        "climbinsight": {
            "frontendtitle" : "Climb Insight - Frontend",
            "backendtitle" : "Climb Insight - Backend",
            "frontenddescription" : "frontend en Angular qui fournit une interface utilisateur interactive pour l'inscription, l'organisation de championnats d'escalade, et la consultation en direct des résultats sur mobiles et tablettes.",
            "backenddescription" : "backend en Django qui gère l'enregistrement des utilisateurs, l'organisation des championnats d'escalade, et l'affichage en direct des résultats."
        },
        "gameoflife": {
            "title" : "Jeu de la vie",
            "description" : "Projet en cours de démarage qui vise à implémenter un jeu de choix batit avec Unity et C++."
        }
    },
    "project.title": "projets majeurs",
    "project.env": "environnement technologique",
    "skills.liferay": "liferay",
    "skills.oracle": "oracle",
    "project1.period": "juin 2020 - septembre 2020",
    "project1.name": "RAIC",
    "project1.detail1": "Création d’une plateforme web pour le guide des architectes canadiens.",
    "project1.detail2": "Réalisations incluent le déploiement d’une plateforme Liferay, échange constant avec le client, écriture et déploiement d’un wiki, écriture de scripts pour les administrateurs de système, et écriture de module (portlets) sur demande pour Liferay.",
    "project2.period": "2020 – 2021",
    "project2.name": "CODE3 - Billetterie",
    "project2.detail1": "Façade JIRA pour les clients. Plateforme interagissant avec l’API JIRA pour l’accès aux billets des projets sur la plateforme infonuagique d’Atlassian.",
    "project2.detail2": "Réalisations incluent le développement en Java 11 avec Spring Boot, architecture de l’application web et de la base de données avec PostgreSQL, écriture d’API REST, utilisation et compréhension de l’API JIRA (et Confluence), et pipeline de déploiement avec Docker Swarm et Jenkins.",
    "project3.period": "mai 2014 – novembre 2019",
    "project3.name": "OPQ",
    "project3.detail1": "Mise à jour de sécurité de la plateforme web en entier, ajout de modules personnalisés et maintenance.",
    "project3.detail2": "Réalisations incluent l'ajout de cryptages, Google Analytics, module de recherche personnalisé, maintenance du site web, et refactoring du code pour optimisation de performance.",
    "project4.period": "2022 - aujourd'hui",
    "project4.name": "Desjardins – Consentement",
    "project4.detail1": "Développement d'un système de gestion de données à haute disponibilité et hyper efficace pour l'ensemble du Mouvement Desjardins.",
    "project4.detail2": "Réalisations incluent le développement d'une suite d'applications, web et API, l'analyse technique et fonctionnelle des besoins métier, la création d'un système de métriques, de traitements par lots, de systèmes RabbitMQ, etc.",
    "contact.phrase": "Derrière chaque défi se cache une solution à découvrir. Trouvons-la ensemble.",
    "contact.form.name": "nom complet",
    "contact.form.email": "adresse courriel",
    "contact.form.message": "message",
    "contact.form.confirmation": "voulez vous envoyer le message? (o/N)",
    "contact.form.prompt1" : "entrer votre nom complet et appuyez sur entrer:",
    "contact.form.prompt2" : "entrer votre adresse courriel et appuyez sur entrer:",
    "contact.form.prompt3" : "entrer votre message et appuyez sur entrer:",
    "landingpage": "en cours de construction...",
    "phrase1": "Dans le jardin de la sagesse, chaque pensée cultivée est une fleur de connaissance.",
    "phrase2": "La patience est l'art d'espérer avec sérénité dans le tumulte du temps.",
    "phrase3": "La vérité est un phare dans l'océan des incertitudes, guidant les navires perdus vers les rivages de la clarté.",
    "phrase4": "La curiosité est le pinceau qui peint les couleurs de la compréhension sur la toile de la vie.",
    "phrase5": "Chaque échec est une graine d'où peut germer l'arbre de la réussite.",
    "phrase6": "Le courage est la lumière qui brille dans les ténèbres de la peur.",
    "phrase7": "Dans le miroir du passé, on trouve les leçons pour construire l'avenir.",
    "phrase8": "L'amitié est un pont entre les âmes, construit sur les fondations de la confiance et de l'empathie.",
    "phrase9": "L'harmonie est la musique de la vie, jouée sur les cordes de l'équilibre et de la paix.",
    "phrase10": "L'humilité est la clé qui ouvre les portes de la sagesse.",
    "phrase11": "Dans le silence, on entend les murmures de la vérité.",
    "phrase12": "La compassion est le soleil qui réchauffe les cœurs froids de l'indifférence.",
    "phrase13": "L'esprit est un oiseau, et chaque nouvelle idée est un ciel à explorer.",
    "phrase14": "La gratitude est la fleur la plus rare et la plus belle dans le jardin de la vie.",
    "phrase15": "Dans chaque problème se cache une opportunité de grandir et d'apprendre.",
    "phrase16": "La persévérance est le sentier rocailleux qui mène au sommet de la montagne de la réussite.",
    "phrase17": "Le bonheur est un papillon qui, lorsqu'on le poursuit, est toujours juste hors de portée, mais qui, si vous vous asseyez tranquillement, peut venir se poser sur vous.",
    "phrase18": "La vie est un livre, et ceux qui ne voyagent pas lisent seulement une page.",
    "phrase19": "Dans la symphonie de la vie, chaque note compte, même la plus silencieuse.",
    "phrase20": "L'amour est la seule force capable de transformer un ennemi en ami.",
    "phrase21": "La joie de vivre est un parfum que l'on ne peut répandre sur les autres sans en recevoir quelques gouttes sur soi-même.",
    "phrase22": "La sagesse est le fruit de l'expérience, mûri sur l'arbre de la vie.",
    "phrase23": "La tolérance est le tissu qui lie les divers fils de l'humanité en une tapisserie de paix.",
    "phrase24": "Chaque sourire est une lumière dans la fenêtre de l'âme, indiquant que le cœur est chez lui.",
    "phrase25": "La créativité est la danse de l'esprit sur la scène des possibilités.",
    "phrase26": "L'intégrité est le gardien silencieux de l'honneur.",
    "phrase27": "Le respect est le langage universel que tout le monde peut comprendre.",
    "phrase28": "Dans le silence de la nature, on découvre les réponses aux questions les plus bruyantes de la vie.",
    "phrase29": "Le partage est la magie qui multiplie la joie et divise le chagrin.",
    "phrase30": "L'enthousiasme est le vent qui gonfle les voiles du navire de nos rêves.",
    "perso.desc" : "Je suis <strong>Guillaume Lévesque</strong>, un ingénieur logiciel canadien français spécialisé en Java (Spring), Angular, PHP, et Python. Mon approche est centrée sur l'innovation et l'efficacité, avec une solide expérience dans le développement de solutions logicielles complètes. Ce site est une vitrine de mes projets et compétences, démontrant ma capacité à relever des défis technologiques complexes. Explorez mes réalisations et n'hésitez pas à me contacter pour discuter de collaborations potentielles."
  }
  